app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("created_at", "string", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-25 08:43:35.331388"], ["string", "11111111111111111"], ["title", "11111111111111"], ["updated_at", "2014-12-25 08:43:35.331388"]]

  def preview
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]