app/controllers/article_controller.rb

INSERT INTO "articles" ("created_at", "string", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-16 08:21:33.846694"], ["string", ""], ["title", ""], ["updated_at", "2014-12-16 08:21:33.846694"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

SELECT "articles".* FROM "articles"
---
  def index
    @article1 = Article.all