app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
---
  def show
    @user = User.friendly.find(params[:id])

SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 20)